saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MKV56F24_DFP.11.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.0" condition="device.MKV56F24_AND_driver.common">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cmp.c"/>
        <file category="header" name="drivers/fsl_cmp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.MKV56F24_AND_driver.common">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.0" condition="device.MKV56F24_AND_driver.common">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="drivers/fsl_aoi.h"/>
        <file category="sourceC" name="drivers/fsl_aoi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.0.0" condition="device.MKV56F24_AND_driver.common">
      <description>ADC16 Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc16.c"/>
        <file category="header" name="drivers/fsl_adc16.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.MKV56F24_AND_device.MKV56F24_CMSIS_AND_driver.clock">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKV56F24" Cversion="1.0.0" condition="device.MKV56F24_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MKV56F24_startup_AND_driver.clock_AND_driver.common_AND_driver.flash_AND_driver.gpio_AND_driver.port_AND_driver.smc_AND_driver.uart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MKV56F24_startup" Cversion="1.0.0" condition="device.MKV56F24_AND_CMSIS_Include_core_cm7">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MKV56F24.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MKV56F24.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV56F1M0xxx24_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV56F1M0xxx24_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV56F512xxx24_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV56F512xxx24_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV56F1M0xxx24_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV56F1M0xxx24_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV56F512xxx24_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV56F512xxx24_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="MKV56F24.h"/>
        <file category="header" attr="config" name="MKV56F24_features.h"/>
        <file category="sourceC" attr="config" name="system_MKV56F24.c"/>
        <file category="header" attr="config" name="system_MKV56F24.h"/>
      </files>
    </component>
  </components>
</package>
